tbobd/certification2/test3/HotelCancellationPolicyRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
    </hot:Credentials>
    <wsa:Action>http://TekTravel/HotelBookingApi/HotelCancellationPolicy</wsa:Action>
    <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelCancellationPolicyRequest>
        <hot:ResultIndex>4</hot:ResultIndex>
        <hot:SessionId>f202b6f1-1060-4c33-b16b-5230df1f6f8e</hot:SessionId>
        <hot:OptionsForBooking>
            <hot:FixedFormat>true</hot:FixedFormat>
            <hot:RoomCombination>
                <hot:RoomIndex>1</hot:RoomIndex>
            </hot:RoomCombination>
        </hot:OptionsForBooking>
    </hot:HotelCancellationPolicyRequest>
</soap:Body>
</soap:Envelope>